music_app/app/models/album.rb

    def band=(name)
        @band = name
        self.band_id = Band.find_by(name: @band).id
---
SELECT  "bands".* FROM "bands" WHERE "bands"."name" = $1 LIMIT $2  [["name", "The Verve"], ["LIMIT", 1]]