music_app/app/models/user.rb

    def self.find_by_credentials(email, password)
        user = self.find_by(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "radwimps"], ["LIMIT", 1]]

    def reset_session_token!
        session_token = User.generate_session_token
        self.session_token = session_token
        self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "UDqe9QMuwkSIkQKMmZlInA"], ["updated_at", "2019-04-04 18:12:39.620351"], ["id", 1]]