music_app/app/controllers/albums_controller.rb

    def new
        @album = Album.new
        @current_band = Band.find_by(id: params[:band_id])
        @bands = Band.all
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT "bands".* FROM "bands"

    def create
        @album = Album.new(album_params)

        if @album.save
---
INSERT INTO "albums" ("title", "year", "band_id", "live", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "groove"], ["year", 2019], ["band_id", 11], ["live", true], ["created_at", "2019-04-04 23:41:56.001806"], ["updated_at", "2019-04-04 23:41:56.001806"]]

    def edit
        @album = Album.find_by(id: params[:id])

        if @album
            @bands = Band.all
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "bands".* FROM "bands"

    def update
        @album = Album.find_by(id: params[:id])

        if @album.update_attributes(album_params)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "albums" SET "year" = $1, "live" = $2, "updated_at" = $3 WHERE "albums"."id" = $4  [["year", 2018], ["live", false], ["updated_at", "2019-04-04 23:59:51.394640"], ["id", 15]]

    def destroy
        @album = Album.find_by(id: params[:id])
        band = @album.band

        @album.destroy
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 14]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 13]]