music_app/app/controllers/bands_controller.rb

    def index
        @bands = Band.all.order('LOWER(name) ASC')
---
SELECT "bands".* FROM "bands" ORDER BY name COLLATE NOCASE ASC