music_app/app/views/bands/show.html.erb

    band = @band
    albums = band.albums.order(:year)
---
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1 ORDER BY "albums"."year" ASC  [["band_id", 10]]